<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"9af3348f6b6f81d1e89b21bc83ddf2bc632e1ea504d5fc45f5d50918e02df30a","plan_job_ref":"Job PR Plan #6 at https://github.com/mpsamuels/mpsamuels_website/actions/runs/12746844320","plan_out_hash":"11f69c8d01fe09dbc68d2e3322d690d5ea23c210c6566826a3df9c5237c008a4","plan_hash":"d88bc252cdfb539e1ef35bd6b85fa6f238665c6bd2d0f8cd6094748b9210d2a7","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __./terraform/s3_website__ in the __prod__ workspace
<details>
<summary>Plan: 6 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.root_s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "root_s3_distribution" {
        id                             = "E2BLM2GJT7D1R1"
        tags                           = {}
+       web_acl_id                     = (known after apply)
#        (19 unchanged attributes hidden)

!~      default_cache_behavior {
!~          viewer_protocol_policy     = "allow-all" -> "redirect-to-https"
#            (15 unchanged attributes hidden)

#            (1 unchanged block hidden)
        }

+       logging_config {
+           bucket          = "logs.mps-website-website-bucket.s3.amazonaws.com"
+           include_cookies = false
+           prefix          = "root"
        }

!~      restrictions {
!~          geo_restriction {
!~              locations        = [
+                   "RUS",
                ]
!~              restriction_type = "none" -> "blacklist"
            }
        }

#        (2 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.www_s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "www_s3_distribution" {
        id                             = "E17HAQKNAVEFRQ"
        tags                           = {}
+       web_acl_id                     = (known after apply)
#        (19 unchanged attributes hidden)

+       logging_config {
+           bucket          = "logs.mps-website-website-bucket.s3.amazonaws.com"
+           include_cookies = false
+           prefix          = "www"
        }

!~      restrictions {
!~          geo_restriction {
!~              locations        = [
+                   "RUS",
                ]
!~              restriction_type = "none" -> "blacklist"
            }
        }

#        (4 unchanged blocks hidden)
    }

  # aws_kms_key.kms-key will be created
+   resource "aws_kms_key" "kms-key" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*************"
+       description                        = (known after apply)
+       enable_key_rotation                = false
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "SIGN_VERIFY"
+       multi_region                       = (known after apply)
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "kms:DescribeKey",
+                           "kms:GetPublicKey",
+                           "kms:Sign",
+                           "kms:Verify",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "dnssec-route53.amazonaws.com"
                        }
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "route53.amazonaws.com"
                        }
+                       Resource  = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       tags_all                           = (known after apply)
    }

  # aws_route53_hosted_zone_dnssec.r53_zone_dnssec is tainted, so must be replaced
-/+ resource "aws_route53_hosted_zone_dnssec" "r53_zone_dnssec" {
!~      id             = "********************" -> (known after apply)
!~      signing_status = "NOT_SIGNING" -> "SIGNING"
#        (1 unchanged attribute hidden)
    }

  # aws_route53_key_signing_key.route53-key-signing-key will be created
+   resource "aws_route53_key_signing_key" "route53-key-signing-key" {
+       digest_algorithm_mnemonic  = (known after apply)
+       digest_algorithm_type      = (known after apply)
+       digest_value               = (known after apply)
+       dnskey_record              = (known after apply)
+       ds_record                  = (known after apply)
+       flag                       = (known after apply)
+       hosted_zone_id             = "********************"
+       id                         = (known after apply)
+       key_management_service_arn = (known after apply)
+       key_tag                    = (known after apply)
+       name                       = "mpsamuels.uk-ksk"
+       public_key                 = (known after apply)
+       signing_algorithm_mnemonic = (known after apply)
+       signing_algorithm_type     = (known after apply)
+       status                     = "ACTIVE"
    }

  # aws_s3_bucket_acl.log_bucket_acl will be created
+   resource "aws_s3_bucket_acl" "log_bucket_acl" {
+       acl    = "private"
+       bucket = "log.mps-website-website-bucket"
+       id     = (known after apply)

+       access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.root_bucket_acl_ownership will be updated in-place
!~  resource "aws_s3_bucket_ownership_controls" "root_bucket_acl_ownership" {
        id     = "mps-website-website-bucket"
#        (1 unchanged attribute hidden)

!~      rule {
!~          object_ownership = "ObjectWriter" -> "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.log_bucket_policy will be created
+   resource "aws_s3_bucket_policy" "log_bucket_policy" {
+       bucket = "log.mps-website-website-bucket"
+       id     = (known after apply)
+       policy = jsonencode(
            {
+               Id        = "PolicyForCloudFrontPrivateContent"
+               Statement = [
+                   {
+                       Action    = "s3:GetObject"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "cloudfront.amazonaws.com"
                        }
+                       Resource  = "arn:aws:s3:::logs.mps-website-website-bucket/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # aws_wafv2_web_acl.website_waf will be created
+   resource "aws_wafv2_web_acl" "website_waf" {
+       arn        = (known after apply)
+       capacity   = (known after apply)
+       id         = (known after apply)
+       lock_token = (known after apply)
+       name       = "rate-based-waf"
+       scope      = "CLOUDFRONT"
+       tags_all   = (known after apply)

+       default_action {
+           allow {
            }
        }

+       rule {
+           name     = "rate-rule"
+           priority = 1

+           action {
+               block {
                }
            }

+           statement {
+               rate_based_statement {
+                   aggregate_key_type = "**"
+                   limit              = 1000
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "rate-rule-metric"
+               sampled_requests_enabled   = false
            }
        }
+       rule {
+           name     = "AWS-AWSManagedRulesKnownBadInputsRuleSet"
+           priority = 2

+           override_action {
+               none {}
            }

+           statement {
+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesKnownBadInputsRuleSet"
+                   vendor_name = "AWS"
#                    (1 unchanged attribute hidden)
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "known-bad-rules-metric-name"
+               sampled_requests_enabled   = false
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = true
+           metric_name                = "defaul-metric-name"
+           sampled_requests_enabled   = false
        }
    }

Plan: 6 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #6](https://github.com/mpsamuels/mpsamuels_website/actions/runs/12746844320)